esp-cpp/espp/components/esp32-p4-wifi6-poe-eth/example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# On ESP-IDF >= v6.0 this symbol defaults to n, which builds an image that
# requires chip revision >= v3.0 and refuses to boot on the rev 0.x/1.x
# ESP32-P4 modules currently shipping; set it so the image runs on pre-v3
# revisions (matches the other espp P4 boards). On ESP-IDF < v6.0 (this
# example's manifest allows >= 5.4) the symbol does not exist and is simply
# ignored with a harmless "unknown kconfig symbol" warning -- v5.x only
# supports the pre-v3 revisions anyway.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# Ethernet (internal EMAC + RMII)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

CONFIG_FREERTOS_HZ=1000

# The board pairs the ESP32-P4NRW32 with a 32 MB GD25Q256E NOR flash (per the
# board schematic), so tell esptool the real size. The example keeps the
# default partition table, which fits comfortably regardless.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
